InformationRegisters/СостоянияЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеВерсииЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВерсийЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящий</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭДПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействияСНашейСтороны</Name>
					<Comment>Признак необходимости выполнения какого-либо действия с ЭД с нашей стороны</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СводныеСостоянияЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействияСоСтороныДругогоУчастника</Name>
					<Comment>Признак ожидания выполнения какого-либо действия со стороны другого участника ЭД</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СводныеСостоянияЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованияЭлектронныхДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОбменСБанками</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОбмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СообщениеОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладельцыОбменСБанками</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыОбменСБанками</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследняяДатаПолученияЭД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЖурналирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогДляЖурналирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменСБанками</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияОбИспользованииЭД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТикетыОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТикетыОбменСБанками</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменСБанками</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияОбИспользованииЭД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЭДОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПодписываемыеВидыЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПодписываемыеВидыЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СертификатЭП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЭД</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыЭДОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыОбменаЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыОбменаЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БыстрыйОбмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезFTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезКаталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезОператораЭДОТакском</Name>
					<Comment>Через оператора электронного документооборота Такском</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезСервис1СЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезЭлектроннуюПочту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЧерезВебРесурсБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Через1СБизнесСеть</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыСоглашенийЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыСоглашенийЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПродажахКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОСписанииКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредложениеОбАннулировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимостиОтправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12Продавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбУточнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросЗонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНаОтзывЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИзвещениеОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКвитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеТребование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПрограммыБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПрограммыБанка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АльфаБанкОнлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АсинхронныйОбмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЧерезВК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЧерезДопОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СбербанкОнлайн</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЭДОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыЭДОбменСБанками</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросЗонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтзывЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеТребование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеЗачисленияДенежныхСредствНаСчетаСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеОткрытияСчетовПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокНаЗачислениеДенежныхСредствНаСчетаСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокНаОткрытиеСчетовПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокУволенныхСотрудников</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбменСБанкамиОбработчикиОбновления/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОбменСБанкамиОбработчикиОбновления: механизм обмена электронными документами с банками.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Подсистема ОбменСБанками стала самодостаточной
//
// Параметры:
//  Параметры - Структура - см. описание создания процедур обработчиков обновления.
//
Процедура ПеренестиДанныеОбменаСБанками(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоглашенияОбИспользованииЭД.Ссылка
	|ИЗ
	|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
	|ГДЕ
	|	СоглашенияОбИспользованииЭД.СпособОбменаЭД = ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.УдалитьЧерезВебРесурсБанка)
	|	И НЕ СоглашенияОбИспользованииЭД.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашенияОбИспользованииЭД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
	|ГДЕ
	|	СоглашенияОбИспользованииЭД.СпособОбменаЭД = ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.УдалитьЧерезВебРесурсБанка)
	|	И СоглашенияОбИспользованииЭД.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашенияОбИспользованииЭД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
	|ГДЕ
	|	СоглашенияОбИспользованииЭД.СпособОбменаЭД = ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.УдалитьЧерезВебРесурсБанка)";
	
	ПакетСоглашения = Запрос.ВыполнитьПакет();
	
	ВыборкаСоглашенийЭДКОбработке = ПакетСоглашения[0].Выбрать();
	ВыборкаОбработанныхСоглашенийЭД = ПакетСоглашения[1].Выбрать();
	ВсегоСоглашенийЭД = ПакетСоглашения[2].Выбрать();
	
	Параметры.ПрогрессВыполнения.ВсегоОбъектов = ВсегоСоглашенийЭД.Количество();
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов = ВыборкаОбработанныхСоглашенийЭД.Количество();
	
	СоответствиеВидовЭД = СоответствиеВидовЭД();
	СоответствиеСостояний = СоответствиеСостояний();
	СоответствиеСтатусов = СоответствиеСтатусов();
	
	Если НЕ ВыборкаСоглашенийЭДКОбработке.Следующий() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
		
	Параметры.ОбработкаЗавершена = Ложь;
	
	ЗапросПоСоглашениям = Новый Запрос;
	ЗапросПоСоглашениям.Текст =
	"ВЫБРАТЬ
	|	СоглашенияОбИспользованииЭД.УдалитьАдресСервера КАК АдресСервера,
	|	СоглашенияОбИспользованииЭД.УдалитьАутентификацияПоСертификату КАК АутентификацияПоСертификату,
	|	СоглашенияОбИспользованииЭД.Контрагент КАК Банк,
	|	СоглашенияОбИспользованииЭД.Организация,
	|	СоглашенияОбИспользованииЭД.УдалитьВнешняяКомпонента КАК ВнешняяКомпонента,
	|	НЕ СоглашенияОбИспользованииЭД.СтатусСоглашения = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийЭД.Действует) КАК Недействительна,
	|	СоглашенияОбИспользованииЭД.УдалитьДополнительнаяОбработка КАК ДополнительнаяОбработка,
	|	СоглашенияОбИспользованииЭД.ИдентификаторОрганизации,
	|	СоглашенияОбИспользованииЭД.УдалитьПользователь КАК ИмяПользователя,
	|	СоглашенияОбИспользованииЭД.УдалитьИспользуетсяКриптография КАК ИспользуетсяКриптография,
	|	СоглашенияОбИспользованииЭД.Комментарий,
	|	СоглашенияОбИспользованииЭД.УдалитьПрограммаБанка КАК ПрограммаБанка,
	|	СоглашенияОбИспользованииЭД.РесурсВходящихДокументов,
	|	СоглашенияОбИспользованииЭД.РесурсИсходящихДокументов,
	|	СоглашенияОбИспользованииЭД.СертификатКонтрагентаДляШифрования,
	|	СоглашенияОбИспользованииЭД.УдалитьСжиматьДанныеПакетаЭД КАК СжиматьДанныеПакетаЭД,
	|	СоглашенияОбИспользованииЭД.ПометкаУдаления,
	|	СоглашенияОбИспользованииЭД.Наименование
	|ИЗ
	|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
	|ГДЕ
	|	СоглашенияОбИспользованииЭД.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашенияОбИспользованииЭДИсходящиеДокументы.ИспользоватьЭП,
	|	СоглашенияОбИспользованииЭДИсходящиеДокументы.ИсходящийДокумент,
	|	СоглашенияОбИспользованииЭДИсходящиеДокументы.Формировать
	|ИЗ
	|	Справочник.СоглашенияОбИспользованииЭД.ИсходящиеДокументы КАК СоглашенияОбИспользованииЭДИсходящиеДокументы
	|ГДЕ
	|	СоглашенияОбИспользованииЭДИсходящиеДокументы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашенияОбИспользованииЭДСертификатыПодписейОрганизации.Сертификат КАК СертификатЭП
	|ИЗ
	|	Справочник.СоглашенияОбИспользованииЭД.СертификатыПодписейОрганизации КАК СоглашенияОбИспользованииЭДСертификатыПодписейОрганизации
	|ГДЕ
	|	СоглашенияОбИспользованииЭДСертификатыПодписейОрганизации.Ссылка = &Ссылка";
	
	ЗапросПоСоглашениям.УстановитьПараметр("Ссылка", ВыборкаСоглашенийЭДКОбработке.Ссылка);
	
	ВыборкаПакетов = ЗапросПоСоглашениям.ВыполнитьПакет();
	ВыборкаПараметровСоглашенияЭД = ВыборкаПакетов[0].Выбрать();
	ВыборкаПараметровСоглашенияЭД.Следующий();
	
	НачатьТранзакцию();
	Попытка
			
		#Область СозданиеНастройкиОбмена
		
		НастройкаОбменаОбъект = Справочники.НастройкиОбменСБанками.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НастройкаОбменаОбъект, ВыборкаПараметровСоглашенияЭД);
		ДанныеВнешнейКомпоненты = ВыборкаПараметровСоглашенияЭД.ВнешняяКомпонента.Получить();
		НастройкаОбменаОбъект.ВнешняяКомпонента = Новый ХранилищеЗначения(ДанныеВнешнейКомпоненты);
		ДанныеСертификатаБанка = ВыборкаПараметровСоглашенияЭД.СертификатКонтрагентаДляШифрования.Получить();
		НастройкаОбменаОбъект.СертификатБанка = Новый ХранилищеЗначения(ДанныеСертификатаБанка);
		
		ВыборкаИсходящихДокументов = ВыборкаПакетов[1].Выбрать();
		Пока ВыборкаИсходящихДокументов.Следующий() Цикл
			
			НовСтрока = НастройкаОбменаОбъект.ИсходящиеДокументы.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаИсходящихДокументов, "ИспользоватьЭП, Формировать");
			НовСтрока.ИсходящийДокумент = СоответствиеВидовЭД.Получить(ВыборкаИсходящихДокументов.ИсходящийДокумент);
			
		КонецЦикла;
		
		ВыборкаСертификатов = ВыборкаПакетов[2].Выбрать();
		Пока ВыборкаСертификатов.Следующий() Цикл
			
			НовСтрока = НастройкаОбменаОбъект.СертификатыПодписейОрганизации.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаСертификатов);
			
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаОбменаОбъект);
		
		НастройкаОбмена = НастройкаОбменаОбъект.Ссылка;
		
		СоглашениеЭДОбъект = ВыборкаСоглашенийЭДКОбработке.Ссылка.ПолучитьОбъект();
		СоглашениеЭДОбъект.ПометкаУдаления = Истина;
		СоглашениеЭДОбъект.Комментарий = НСтр("ru='##Настройка ЭДО помечена на удаление автоматически при обновлении.';uk='##Настройка ЭДО помечена на удаление автоматически при обновлении.'");
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СоглашениеЭДОбъект);
		
		#КонецОбласти
		
		#Область ПереносПрисоединенныхФайлов
		
		ЗапросЭДПрисоединенныеФайлы = Новый Запрос;
		ЗапросЭДПрисоединенныеФайлы.Текст =
		"ВЫБРАТЬ
		|	ЭДПрисоединенныеФайлы.Ссылка,
		|	ЭДПрисоединенныеФайлы.Наименование,
		|	ЭДПрисоединенныеФайлы.ВидЭД,
		|	ЭДПрисоединенныеФайлы.ВладелецФайла,
		|	ЭДПрисоединенныеФайлы.Автор,
		|	ЭДПрисоединенныеФайлы.ДатаМодификацииУниверсальная,
		|	ЭДПрисоединенныеФайлы.ДатаСоздания,
		|	ЭДПрисоединенныеФайлы.Изменил,
		|	ЭДПрисоединенныеФайлы.ИндексКартинки,
		|	ЭДПрисоединенныеФайлы.Описание,
		|	ЭДПрисоединенныеФайлы.ПодписанЭП,
		|	ЭДПрисоединенныеФайлы.ПутьКФайлу,
		|	ЭДПрисоединенныеФайлы.Размер,
		|	ЭДПрисоединенныеФайлы.Расширение,
		|	ЭДПрисоединенныеФайлы.Редактирует,
		|	ЭДПрисоединенныеФайлы.СтатусИзвлеченияТекста,
		|	ЭДПрисоединенныеФайлы.ТекстХранилище,
		|	ЭДПрисоединенныеФайлы.ТипХраненияФайла,
		|	ЭДПрисоединенныеФайлы.Том,
		|	ЭДПрисоединенныеФайлы.ФайлХранилище,
		|	ЭДПрисоединенныеФайлы.СтатусЭД,
		|	СостоянияЭД.СсылкаНаОбъект,
		|	СостоянияЭД.СостояниеВерсииЭД,
		|	ЭДПрисоединенныеФайлы.УникальныйИДВнешний КАК ВнешнийИдентификатор,
		|	ЭДПрисоединенныеФайлы.ДатаДокументаОтправителя,
		|	ЭДПрисоединенныеФайлы.УдалитьДатаИзмененияВнешнегоСтатусаЭД КАК ДатаИзмененияВнешнегоСтатуса,
		|	ЭДПрисоединенныеФайлы.ДатаИзмененияСтатусаЭД КАК ДатаИзмененияСтатуса,
		|	ЭДПрисоединенныеФайлы.УдалитьДатаВыпискиБанка КАК ДатаСообщения,
		|	ЭДПрисоединенныеФайлы.ДополнительнаяИнформация,
		|	ЭДПрисоединенныеФайлы.ДополнительныеРеквизиты,
		|	ЭДПрисоединенныеФайлы.НомерЭД КАК Идентификатор,
		|	ЭДПрисоединенныеФайлы.НаправлениеЭД КАК Направление,
		|	ЭДПрисоединенныеФайлы.НомерДокументаОтправителя,
		|	ЭДПрисоединенныеФайлы.Организация,
		|	ЭДПрисоединенныеФайлы.ПричинаОтклонения,
		|	ЭДПрисоединенныеФайлы.СуммаДокумента,
		|	ЭДПрисоединенныеФайлы.ПометкаУдаления
		|ИЗ
		|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭД КАК СостоянияЭД
		|		ПО (СостоянияЭД.ЭлектронныйДокумент = ЭДПрисоединенныеФайлы.Ссылка)
		|ГДЕ
		|	ЭДПрисоединенныеФайлы.СоглашениеЭД = &СоглашениеЭД
		|	И НЕ ЭДПрисоединенныеФайлы.ВидЭД = ЗНАЧЕНИЕ(Перечисление.ВидыЭД.ПустаяСсылка)";
		
		ЗапросЭДПрисоединенныеФайлы.УстановитьПараметр("СоглашениеЭД", ВыборкаСоглашенийЭДКОбработке.Ссылка);
		
		ВыборкаРеквизитыЭД = ЗапросЭДПрисоединенныеФайлы.Выполнить().Выбрать();
		
		СоответствиеЭДИСообщенийОбмена = Новый Соответствие;
		
		Пока ВыборкаРеквизитыЭД.Следующий() Цикл
			НовСообщение = Документы.СообщениеОбменСБанками.СоздатьДокумент();
			НовСообщение.Банк = НастройкаОбменаОбъект.Банк;
			НовСообщение.ВидЭД = СоответствиеВидовЭД.Получить(ВыборкаРеквизитыЭД.ВидЭД);
			ЗаполнитьЗначенияСвойств(НовСообщение, ВыборкаРеквизитыЭД, "ВнешнийИдентификатор, ДатаДокументаОтправителя,
				|ДатаИзмененияВнешнегоСтатуса, ДатаИзмененияСтатуса, ДатаСообщения, ДополнительнаяИнформация, Идентификатор,
				|Направление, НомерДокументаОтправителя, Организация, ПричинаОтклонения, ПометкаУдаления");
			НовСообщение.Дата = ВыборкаРеквизитыЭД.ДатаСоздания;
			НовСообщение.ДополнительныеДанные = Новый ХранилищеЗначения(ВыборкаРеквизитыЭД.ДополнительныеРеквизиты.Получить());
			НовСообщение.НастройкаОбмена = НастройкаОбмена;
			Если ВыборкаРеквизитыЭД.ВидЭД = Перечисления["ВидыЭД"].УдалитьВыпискаБанка Тогда
				НовСообщение.НомерСчета = ВыборкаРеквизитыЭД.ДополнительнаяИнформация;
			КонецЕсли;
			
			НовСообщение.Состояние = СоответствиеСостояний.Получить(ВыборкаРеквизитыЭД.СостояниеВерсииЭД);
			НовСообщение.Статус = СоответствиеСтатусов.Получить(ВыборкаРеквизитыЭД.СтатусЭД);
			НовСообщение.УстановитьНовыйНомер();
			НовСообщение.Представление = ПредставлениеЭД(
				ВыборкаРеквизитыЭД.Наименование, НовСообщение.ВидЭД, ВыборкаРеквизитыЭД.ВладелецФайла);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НовСообщение);

			ЗапросПоЭП = Новый Запрос;
			ЗапросПоЭП.Текст =
			"ВЫБРАТЬ
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.НомерСтроки КАК НомерСтроки,
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.ПодписьВерна,
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.ДатаПроверкиПодписи,
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.ДатаПодписи,
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.ИмяФайлаПодписи,
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.Комментарий,
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.КомуВыданСертификат,
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.Отпечаток,
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.Подпись,
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.Сертификат,
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.УстановившийПодпись
			|ИЗ
			|	Справочник.ЭДПрисоединенныеФайлы.ЭлектронныеПодписи КАК ЭДПрисоединенныеФайлыЭлектронныеПодписи
			|ГДЕ
			|	ЭДПрисоединенныеФайлыЭлектронныеПодписи.Ссылка = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			ЗапросПоЭП.УстановитьПараметр("Ссылка", ВыборкаРеквизитыЭД.Ссылка);
			ВыборкаПоЭП = ЗапросПоЭП.Выполнить().Выбрать();
			
			СообщениеОбмена = НовСообщение.Ссылка;
			СоответствиеЭДИСообщенийОбмена.Вставить(ВыборкаРеквизитыЭД.Ссылка, СообщениеОбмена);
			
			ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(ВыборкаРеквизитыЭД.Ссылка);
			
			ПараметрыФайла = Новый Структура();
			ПараметрыФайла.Вставить("Автор", Пользователи.АвторизованныйПользователь());
			ПараметрыФайла.Вставить("ВладелецФайлов", СообщениеОбмена);
			ПараметрыФайла.Вставить("ИмяБезРасширения", ДанныеФайла.ИмяФайла);
			ПараметрыФайла.Вставить("РасширениеБезТочки", ДанныеФайла.Расширение);
			ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное");
			
			ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьПрисоединенныйФайл(
				ПараметрыФайла, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
			
			ОбъектПрисоединенныйФайл = ПрисоединенныйФайл.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(ОбъектПрисоединенныйФайл, ВыборкаРеквизитыЭД,
				"Автор, ДатаМодификацииУниверсальная, ДатаСоздания, Изменил, Описание, ПутьКФайлу, Наименование, ПодписанЭП");
			
			Пока ВыборкаПоЭП.Следующий() Цикл
				НовСтрока = ОбъектПрисоединенныйФайл.ЭлектронныеПодписи.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаПоЭП, , "НомерСтроки, Подпись, Сертификат");
				НовСтрока.Подпись = Новый ХранилищеЗначения(ВыборкаПоЭП.Подпись.Получить());
				НовСтрока.Сертификат = Новый ХранилищеЗначения(ВыборкаПоЭП.Сертификат.Получить());
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектПрисоединенныйФайл);
			
			ЭД = ВыборкаРеквизитыЭД.Ссылка.ПолучитьОбъект();
			ЭД.ПометкаУдаления = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭД);
		
		КонецЦикла;
		
		// Заполнение родителей
		ЗапросПоВладельцам = Новый Запрос;
		ЗапросПоВладельцам.Текст =
		"ВЫБРАТЬ
		|	ЭДПрисоединенныеФайлы.Ссылка,
		|	ЭДПрисоединенныеФайлы.ЭлектронныйДокументВладелец
		|ИЗ
		|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
		|ГДЕ
		|	НЕ ЭДПрисоединенныеФайлы.ЭлектронныйДокументВладелец = ЗНАЧЕНИЕ(Справочник.ЭДПрисоединенныеФайлы.ПустаяСсылка)
		|	И ЭДПрисоединенныеФайлы.СоглашениеЭД = &СоглашениеЭД";
		ЗапросПоВладельцам.УстановитьПараметр("СоглашениеЭД", ВыборкаСоглашенийЭДКОбработке.Ссылка);
		ВыборкаЭДПоВладельцам = ЗапросПоВладельцам.Выполнить().Выбрать();
		Пока ВыборкаЭДПоВладельцам.Следующий() Цикл
			
			СообщениеОбмена = СоответствиеЭДИСообщенийОбмена.Получить(ВыборкаЭДПоВладельцам.Ссылка);
			СообщениеОбменаРодитель = СоответствиеЭДИСообщенийОбмена.Получить(
				ВыборкаЭДПоВладельцам.ЭлектронныйДокументВладелец);
				
			Если ЗначениеЗаполнено(СообщениеОбменаРодитель) И ЗначениеЗаполнено(СообщениеОбмена) Тогда
				СообщениеОбменаОбъект = СообщениеОбмена.ПолучитьОбъект();
				СообщениеОбменаОбъект.СообщениеРодитель = СообщениеОбменаРодитель;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СообщениеОбменаОбъект);
			КонецЕсли;
			
		КонецЦикла;
		
		#КонецОбласти
		
		#Область ПереносСостоянийЭД
		
		ЗапросПоСостояниям = Новый Запрос();
		ЗапросПоСостояниям.Текст =
		"ВЫБРАТЬ
		|	СостоянияЭД.СсылкаНаОбъект,
		|	СостоянияЭД.СостояниеВерсииЭД,
		|	СостоянияЭД.ЭлектронныйДокумент
		|ИЗ
		|	РегистрСведений.СостоянияЭД КАК СостоянияЭД
		|ГДЕ
		|	СостоянияЭД.ЭлектронныйДокумент.СоглашениеЭД = &СоглашениеЭД";
		ЗапросПоСостояниям.УстановитьПараметр("СоглашениеЭД", ВыборкаСоглашенийЭДКОбработке.Ссылка);
		ВыборкаПоСостояниям = ЗапросПоСостояниям.Выполнить().Выбрать();
		Пока ВыборкаПоСостояниям.Следующий() Цикл
			
			СообщениеОбмена = СоответствиеЭДИСообщенийОбмена.Получить(ВыборкаПоСостояниям.ЭлектронныйДокумент);
			Если ЗначениеЗаполнено(СообщениеОбмена) Тогда
				МенеджерРегистраСостоянияОбменСБанками = РегистрыСведений.СостоянияОбменСБанками.СоздатьМенеджерЗаписи();
				МенеджерРегистраСостоянияОбменСБанками.СсылкаНаОбъект = ВыборкаПоСостояниям.СсылкаНаОбъект;
				МенеджерРегистраСостоянияОбменСБанками.СообщениеОбмена = СообщениеОбмена;
				МенеджерРегистраСостоянияОбменСБанками.Состояние = СоответствиеСостояний.Получить(
					ВыборкаПоСостояниям.СостояниеВерсииЭД);
				МенеджерРегистраСостоянияОбменСБанками.Записать();
			КонецЕсли;
			
			МенеджерРегистраСостоянияЭД = РегистрыСведений["СостоянияЭД"].СоздатьМенеджерЗаписи();
			МенеджерРегистраСостоянияЭД.СсылкаНаОбъект = ВыборкаПоСостояниям.СсылкаНаОбъект;
			МенеджерРегистраСостоянияЭД.Удалить();
			
		КонецЦикла;
		
		#КонецОбласти
		
		#Область УдалениеПакетовЭД
		
		ЗапросПоПакетам = Новый Запрос;
		ЗапросПоПакетам.Текст =
		"ВЫБРАТЬ
		|	ПакетЭД.Ссылка
		|ИЗ
		|	Документ.ПакетЭД КАК ПакетЭД
		|ГДЕ
		|	ПакетЭД.НастройкаЭДО = &НастройкаЭДО
		|	И НЕ ПакетЭД.ПометкаУдаления";
		
		ЗапросПоПакетам.УстановитьПараметр("НастройкаЭДО", ВыборкаСоглашенийЭДКОбработке.Ссылка);
		ВыборкаПакетов = ЗапросПоПакетам.Выполнить().Выбрать();
		Пока ВыборкаПакетов.Следующий() Цикл
			ПакетОбъект = ВыборкаПакетов.Ссылка.ПолучитьОбъект();
			ПакетОбъект.ПометкаУдаления = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПакетОбъект);
		КонецЦикла;
		
		#КонецОбласти

		#Область ОбработкаРегистраПараметрыОбменСБанками
		
		МенеджерРегистраПараметрыОбменСБанками = РегистрыСведений.ПараметрыОбменСБанками.СоздатьМенеджерЗаписи();
		МенеджерРегистраПараметрыОбменСБанками.НастройкаОбмена = ВыборкаСоглашенийЭДКОбработке.Ссылка;
		МенеджерРегистраПараметрыОбменСБанками.Прочитать();
		Если МенеджерРегистраПараметрыОбменСБанками.Выбран() Тогда
			НаборЗаписейРегистраПараметрыОбменСБанками = РегистрыСведений.ПараметрыОбменСБанками.СоздатьНаборЗаписей();
			НаборЗаписейРегистраПараметрыОбменСБанками.Отбор.НастройкаОбмена.Установить(НастройкаОбмена);
			НовЗапись = НаборЗаписейРегистраПараметрыОбменСБанками.Добавить();
			ЗаполнитьЗначенияСвойств(НовЗапись, МенеджерРегистраПараметрыОбменСБанками, "ПоследняяДатаПолученияЭД, Метка");
			НовЗапись.НастройкаОбмена = НастройкаОбмена;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейРегистраПараметрыОбменСБанками);
		КонецЕсли;
		
		#КонецОбласти
		
		#Область ТикетыОбменСБанками
		
		СтарыйНаборЗаписейРегистраТикетыОбменСБанками = РегистрыСведений.ТикетыОбменСБанками.СоздатьНаборЗаписей();
		СтарыйНаборЗаписейРегистраТикетыОбменСБанками.Отбор.НастройкаОбмена.Установить(ВыборкаСоглашенийЭДКОбработке.Ссылка);
		СтарыйНаборЗаписейРегистраТикетыОбменСБанками.Прочитать();
		
		НовыйНаборЗаписейРегистраТикетыОбменСБанками = РегистрыСведений.ТикетыОбменСБанками.СоздатьНаборЗаписей();
		НовыйНаборЗаписейРегистраТикетыОбменСБанками.Отбор.НастройкаОбмена.Установить(НастройкаОбмена);
		
		Для Каждого СтараяЗапись Из СтарыйНаборЗаписейРегистраТикетыОбменСБанками Цикл
			НоваяЗапись = НовыйНаборЗаписейРегистраТикетыОбменСБанками.Добавить();
			НоваяЗапись.ВидЭД = СоответствиеВидовЭД.Получить(СтараяЗапись.ВидЭД);
			НоваяЗапись.Идентификатор = СтараяЗапись.Идентификатор;
			НоваяЗапись.НастройкаОбмена = НастройкаОбмена;
		КонецЦикла;
		
		Если НовыйНаборЗаписейРегистраТикетыОбменСБанками.Количество() Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйНаборЗаписейРегистраТикетыОбменСБанками);
		КонецЕсли;
	
		#КонецОбласти
		
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Операция = НСтр("ru='Обновление подсистемы прямого обмена с банками';uk='Обновление подсистемы прямого обмена с банками'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='При обновлении подсистемы прямого обмена с банками произошла ошибка';uk='При обновлении подсистемы прямого обмена с банками произошла ошибка'");
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(
			Операция, ПодробныйТекстОшибки, ТекстСообщения, 1, ВыборкаСоглашенийЭДКОбработке.Ссылка);
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Добавление новых подписываемых видов ЭД и удаление старых
//
// Параметры:
//  Параметры - Структура - см. описание создания процедур обработчиков обновления.
//
Процедура ОбработатьРегистрПодписываемыеВидыЭД(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	Попытка
	
		НаборЗаписейРегистра = РегистрыСведений.ПодписываемыеВидыЭД.СоздатьНаборЗаписей();
		НаборЗаписейРегистра.Прочитать();
	
		СоответствиеВидовЭД = СоответствиеВидовЭД();
	
		Для Каждого Запись Из НаборЗаписейРегистра Цикл
			
			НовыйВидЭД = СоответствиеВидовЭД.Получить(Запись.ВидЭД);
			Если НовыйВидЭД <> Неопределено Тогда
				Запись.ВидЭД = НовыйВидЭД;
			КонецЕсли;
			
		КонецЦикла;
		
		ТаблицаСвертки = НаборЗаписейРегистра.Выгрузить();
		ТаблицаСвертки.Свернуть("СертификатЭП, ВидЭД, Использовать");
		НаборЗаписейРегистра.Загрузить(ТаблицаСвертки);
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейРегистра);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Операция = НСтр("ru='Обновление подсистемы прямого обмена с банками';uk='Обновление подсистемы прямого обмена с банками'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='При обновлении подсистемы прямого обмена с банками произошла ошибка';uk='При обновлении подсистемы прямого обмена с банками произошла ошибка'");
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения, 1);
		ВызватьИсключение;
		
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

// Переносить данные дополнительной обработки из справочника в константу
//
// Параметры:
//  Параметры - Структура - см. описание создания процедур обработчиков обновления.
//
Процедура ПеренестиДанныеДополнительныхОбработокВКонстанту(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
		
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки") Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиОбменСБанками.Ссылка,
		|	НастройкиОбменСБанками.УдалитьДополнительнаяОбработка.ИмяОбъекта КАК ИмяОбъекта,
		|	НастройкиОбменСБанками.УдалитьДополнительнаяОбработка.ХранилищеОбработки КАК ХранилищеОбработки,
		|	НастройкиОбменСБанками.УдалитьДополнительнаяОбработка.Версия КАК Версия,
		|	НастройкиОбменСБанками.УдалитьДополнительнаяОбработка.Наименование КАК Наименование
		|ИЗ
		|	Справочник.НастройкиОбменСБанками КАК НастройкиОбменСБанками
		|ГДЕ
		|	НастройкиОбменСБанками.ПрограммаБанка = ЗНАЧЕНИЕ(Перечисление.ПрограммыБанка.ОбменЧерезДопОбработку)
		|	И НЕ НастройкиОбменСБанками.Недействительна
		|	И НЕ НастройкиОбменСБанками.ПометкаУдаления
		|	И НЕ НастройкиОбменСБанками.УдалитьДополнительнаяОбработка = ЗНАЧЕНИЕ(Справочник.ДополнительныеОтчетыИОбработки.ПустаяСсылка)
		|	И НастройкиОбменСБанками.ИмяВнешнегоМодуля = """"";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекущаяВерсия = "";
			ОбменСБанкамиСлужебныйВызовСервера.ПроверитьАктуальностьВнешнейОбработки(
				Выборка.ИмяОбъекта, Выборка.Версия, ТекущаяВерсия);
			Если НЕ ЗначениеЗаполнено(ТекущаяВерсия) ИЛИ ТекущаяВерсия < Выборка.Версия Тогда
				АдресВнешнейОбработки = ПоместитьВоВременноеХранилище(Выборка.ХранилищеОбработки.Получить());
				ОбменСБанкамиСлужебный.СохранитьВнешнююОбработку(
					АдресВнешнейОбработки, Выборка.Версия, Выборка.ИмяОбъекта, Выборка.Наименование);
			КонецЕсли;
			
			НастройкаОбменаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			НастройкаОбменаОбъект.ИмяВнешнегоМодуля = Выборка.ИмяОбъекта;
			НастройкаОбменаОбъект.УдалитьДополнительнаяОбработка = Справочники["ДополнительныеОтчетыИОбработки"].ПустаяСсылка();
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаОбменаОбъект);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		Операция = НСтр("ru='Обновление подсистемы прямого обмена с банками';uk='Обновление подсистемы прямого обмена с банками'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='При обновлении подсистемы прямого обмена с банками произошла ошибка';uk='При обновлении подсистемы прямого обмена с банками произошла ошибка'");
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения, 1);
		ВызватьИсключение;
		
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = Истина;

КонецПроцедуры

// Переносит статусы электронных подписей в справочник присоединенных файлов
//
// Параметры:
//  Параметры - Структура - см. описание создания процедур обработчиков обновления.
//
Процедура ПеренестиСтатусыЭлектронныхПодписей(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеОбменСБанками.Ссылка КАК СообщениеОбмена,
		|	СообщениеОбменСБанками.УдалитьСтатусыЭлектронныхПодписей.(
		|		НомерСтроки,
		|		ДатаПроверкиПодписи,
		|		ПодписьВерна
		|	),
		|	СообщениеОбменСБанкамиПрисоединенныеФайлы.Ссылка КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.СообщениеОбменСБанками КАК СообщениеОбменСБанками
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СообщениеОбменСБанкамиПрисоединенныеФайлы КАК СообщениеОбменСБанкамиПрисоединенныеФайлы
		|		ПО (СообщениеОбменСБанкамиПрисоединенныеФайлы.ВладелецФайла = СообщениеОбменСБанками.Ссылка)";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ЭлектронныйДокумент) Цикл
			ЗаписатьОбъект = Ложь;
			ВыборкаСтатусовЭП = Выборка.УдалитьСтатусыЭлектронныхПодписей.Выбрать();
			Если ВыборкаСтатусовЭП.Количество() Тогда
				ПрисоединенныйФайлОбъект = Выборка.ЭлектронныйДокумент.ПолучитьОбъект();
				Пока ВыборкаСтатусовЭП.Следующий() Цикл
					ИскомаяСтрока = ПрисоединенныйФайлОбъект.ЭлектронныеПодписи.Найти(ВыборкаСтатусовЭП.НомерСтроки, "НомерСтроки");
					Если ИскомаяСтрока = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					ЗаписатьОбъект = Истина;
					ЗаполнитьЗначенияСвойств(ИскомаяСтрока, ВыборкаСтатусовЭП);
				КонецЦикла;
			КонецЕсли;
			Если ЗаписатьОбъект Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПрисоединенныйФайлОбъект);
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		Операция = НСтр("ru='Обновление подсистемы прямого обмена с банками';uk='Обновление подсистемы прямого обмена с банками'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='При обновлении подсистемы прямого обмена с банками произошла ошибка';uk='При обновлении подсистемы прямого обмена с банками произошла ошибка'");
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения, 1);
		ВызватьИсключение;
		
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = Истина;

КонецПроцедуры

// Включает рег.задание по обновлению списка банков
//
// Параметры:
//  Параметры - Структура - см. описание создания процедур обработчиков обновления.
//
Процедура ВключитьАвтоматическоеОбновлениеСпискаБанков(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;

	Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Использование", Истина);
		
		ИдентификаторЗадания = РегламентныеЗаданияСервер.УникальныйИдентификатор(
			Метаданные.РегламентныеЗадания.ЗагрузкаСпискаDirectBank);
		РегламентныеЗаданияСервер.ИзменитьЗадание(ИдентификаторЗадания, ПараметрыЗадания);
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоответствиеВидовЭД()
	
	СоответствиеВозврата = Новый Соответствие;
	СоответствиеВозврата.Вставить(Перечисления["ВидыЭД"].ДопДанные,
		Перечисления.ВидыЭДОбменСБанками.ДополнительныеДанные);
	СоответствиеВозврата.Вставить(Перечисления["ВидыЭД"].УдалитьВыпискаБанка, Перечисления.ВидыЭДОбменСБанками.ВыпискаБанка);
	СоответствиеВозврата.Вставить(
		Перечисления["ВидыЭД"].УдалитьЗапросВыписки, Перечисления.ВидыЭДОбменСБанками.ЗапросВыписки);
	СоответствиеВозврата.Вставить(Перечисления["ВидыЭД"].УдалитьЗапросЗонд, Перечисления.ВидыЭДОбменСБанками.ЗапросЗонд);
	СоответствиеВозврата.Вставить(
		Перечисления["ВидыЭД"].УдалитьЗапросНаОтзывЭД, Перечисления.ВидыЭДОбменСБанками.ЗапросНаОтзывЭД);
	СоответствиеВозврата.Вставить(
		Перечисления["ВидыЭД"].УдалитьЗапросНочнойВыписки, Перечисления.ВидыЭДОбменСБанками.ЗапросНочнойВыписки);
	СоответствиеВозврата.Вставить(
		Перечисления["ВидыЭД"].УдалитьЗапросОСостоянииЭД, Перечисления.ВидыЭДОбменСБанками.ЗапросОСостоянииЭД);
	СоответствиеВозврата.Вставить(
		Перечисления["ВидыЭД"].УдалитьИзвещениеОСостоянииЭД, Перечисления.ВидыЭДОбменСБанками.ИзвещениеОСостоянииЭД);
	СоответствиеВозврата.Вставить(Перечисления["ВидыЭД"].УдалитьКвитанция, Перечисления.ВидыЭДОбменСБанками.Квитанция);
	СоответствиеВозврата.Вставить(
		Перечисления["ВидыЭД"].УдалитьПлатежноеПоручение, Перечисления.ВидыЭДОбменСБанками.ПлатежноеПоручение);
	СоответствиеВозврата.Вставить(
		Перечисления["ВидыЭД"].УдалитьПлатежноеТребование, Перечисления.ВидыЭДОбменСБанками.ПлатежноеТребование);
		
	Возврат СоответствиеВозврата
		
КонецФункции

Функция СоответствиеСостояний()
	
	СоответствиеВозврата = Новый Соответствие;
	СоответствиеВозврата.Вставить(
		Перечисления["СостоянияВерсийЭД"].Аннулирован, Перечисления.СостоянияОбменСБанками.Аннулирован);
	СоответствиеВозврата.Вставить(
		Перечисления["СостоянияВерсийЭД"].НаПодписи, Перечисления.СостоянияОбменСБанками.НаПодписи);
	СоответствиеВозврата.Вставить(
		Перечисления["СостоянияВерсийЭД"].НаУтверждении, Перечисления.СостоянияОбменСБанками.НаУтверждении);
	СоответствиеВозврата.Вставить(
		Перечисления["СостоянияВерсийЭД"].НеСформирован, Перечисления.СостоянияОбменСБанками.НеСформирован);
	СоответствиеВозврата.Вставить(
		Перечисления["СостоянияВерсийЭД"].УдалитьОжидаетсяВыписка, Перечисления.СостоянияОбменСБанками.ОжидаетсяВыписка);
	СоответствиеВозврата.Вставить(Перечисления["СостоянияВерсийЭД"].ОжидаетсяИзвещениеОПолучении,
		Перечисления.СостоянияОбменСБанками.ОжидаетсяИзвещениеОПолучении);
	СоответствиеВозврата.Вставить(
		Перечисления["СостоянияВерсийЭД"].УдалитьОжидаетсяИсполнение, Перечисления.СостоянияОбменСБанками.ОжидаетсяИсполнение);
	СоответствиеВозврата.Вставить(
		Перечисления["СостоянияВерсийЭД"].ОжидаетсяОтправка, Перечисления.СостоянияОбменСБанками.ТребуетсяОтправка);
	СоответствиеВозврата.Вставить(Перечисления["СостоянияВерсийЭД"].Отклонен, Перечисления.СостоянияОбменСБанками.Отклонен);
	СоответствиеВозврата.Вставить(
		Перечисления["СостоянияВерсийЭД"].ОшибкаПередачи, Перечисления.СостоянияОбменСБанками.ОшибкаПередачи);
	СоответствиеВозврата.Вставить(
		Перечисления["СостоянияВерсийЭД"].УдалитьПлатежИсполнен, Перечисления.СостоянияОбменСБанками.ПлатежИсполнен);
	СоответствиеВозврата.Вставить(
		Перечисления["СостоянияВерсийЭД"].УдалитьТребуетсяПодтверждение, Перечисления.СостоянияОбменСБанками.ТребуетсяПодтверждение);
	
	Возврат СоответствиеВозврата
		
КонецФункции

Функция СоответствиеСтатусов()
	
	СоответствиеВозврата = Новый Соответствие;
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].Аннулирован, Перечисления.СтатусыОбменСБанками.Аннулирован);
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].Доставлен, Перечисления.СтатусыОбменСБанками.Доставлен);
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].НеСформирован, Перечисления.СтатусыОбменСБанками.НеСформирован);
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].Обработан, Перечисления.СтатусыОбменСБанками.Обработан);
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].Отклонен, Перечисления.СтатусыОбменСБанками.Отклонен);
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].Отправлен, Перечисления.СтатусыОбменСБанками.Отправлен);
	СоответствиеВозврата.Вставить(
		Перечисления["СтатусыЭД"].ОшибкаПередачи, Перечисления.СтатусыОбменСБанками.ОшибкаПередачи);
	СоответствиеВозврата.Вставить(
		Перечисления["СтатусыЭД"].ПодготовленКОтправке, Перечисления.СтатусыОбменСБанками.ПодготовленКОтправке);
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].Подписан, Перечисления.СтатусыОбменСБанками.Подписан);
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].Получен, Перечисления.СтатусыОбменСБанками.Получен);
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].Принят, Перечисления.СтатусыОбменСБанками.Принят);
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].Сформирован, Перечисления.СтатусыОбменСБанками.Сформирован);
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].Утвержден, Перечисления.СтатусыОбменСБанками.Утвержден);
	СоответствиеВозврата.Вставить(Перечисления["СтатусыЭД"].УдалитьИсполнен, Перечисления.СтатусыОбменСБанками.Исполнен);
	СоответствиеВозврата.Вставить(
		Перечисления["СтатусыЭД"].УдалитьКартотека2, Перечисления.СтатусыОбменСБанками.Приостановлен);
	СоответствиеВозврата.Вставить(
		Перечисления["СтатусыЭД"].УдалитьОтказанАБС, Перечисления.СтатусыОбменСБанками.ОтклоненБанком);
	СоответствиеВозврата.Вставить(
		Перечисления["СтатусыЭД"].УдалитьОтклоненБанком, Перечисления.СтатусыОбменСБанками.ОтклоненБанком);
	СоответствиеВозврата.Вставить(
		Перечисления["СтатусыЭД"].УдалитьОшибкаРеквизитов, Перечисления.СтатусыОбменСБанками.ОтклоненБанком);
	СоответствиеВозврата.Вставить(
		Перечисления["СтатусыЭД"].УдалитьПодтвержден, Перечисления.СтатусыОбменСБанками.Подтвержден);
	СоответствиеВозврата.Вставить(
		Перечисления["СтатусыЭД"].УдалитьПриостановлен, Перечисления.СтатусыОбменСБанками.Приостановлен);
	СоответствиеВозврата.Вставить(
		Перечисления["СтатусыЭД"].УдалитьЭПНеВерна, Перечисления.СтатусыОбменСБанками.ОтклоненБанком);
	СоответствиеВозврата.Вставить(
		Перечисления["СтатусыЭД"].ЧастичноПодписан, Перечисления.СтатусыОбменСБанками.ЧастичноПодписан);
	Возврат СоответствиеВозврата
		
КонецФункции

Функция ПредставлениеЭД(Наименование, ВидЭД, СсылкаНаОбъект)
	
	ПутьКСправочникуСоглашенийЭД = "СправочникСсылка.СоглашенияОбИспользованииЭД";
	
	Если СсылкаНаОбъект = Неопределено ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип(ПутьКСправочникуСоглашенийЭД) Тогда
		Возврат Наименование;
	КонецЕсли;
	
	ШаблонПредставленияЭД = НСтр("ru='%1 %2 от %3';uk='%1 %2 от %3'");
	
	ПечатныйНомерДокумента = ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьПечатныйНомерДокумента(СсылкаНаОбъект);
	ДатаСтрокой = Формат(СсылкаНаОбъект.Дата, "ДЛФ=D");
	СтрокаИмениФайла = СтрШаблон(ШаблонПредставленияЭД, ВидЭД, ПечатныйНомерДокумента, ДатаСтрокой);
	
	Возврат СтрокаИмениФайла;
	
КонецФункции

#КонецОбласти
